import UIKit

let rundomNumverArray:[Int] = [128535, 128537, 128538, 128523, 128577, 128547, 128534, 128555, 128553, 129396, 129314, 129326, 129319, 128567, 129298, 129301, 129297, 129312, 128520, 128127, 128121, 128122, 129313, 128169, 128123, 128128, 128125, 128126, 129302, 127875, 128570, 128568, 128569, 128571, 128572, 128573, 128576, 128575, 128574, 129330, 128080, 128588, 128079, 129309, 128077, 128078, 128074, 129307, 129308, 129310, 129311, 129304, 128076, 129295, 128072, 128073, 128070, 128071, 129295, 128072, 128073, 128070, 128071, 128054, 128049, 128045, 128057, 128048, 129418, 128059, 128060, 128040, 128047, 128046, 128055, 128061, 128056, 128053, 128584, 128585, 128586, 128020, 128039, 128038, 128036, 129430, 129429, 128025, 129425, 129424, 129438, 129408, 128033, 128241, 128242, 128187, 127981, 127970, 127980, 127971, 127972, 127973, 127974, 129685, 127931, 127922, 127919, 127923, 127918, 127920, 129513, 127827, 127816, 127826, 127825, 127821, 129381, 129373, 128175, 128162, 129359, 127921, 129664, 127955, 127992, 127954, 127953, 129357]

var n = 0
for i in rundomNumverArray {
    n += 1
    //文字コードをあ使うためのインスタンス作成
    var vowelView = String.UnicodeScalarView()
    var hiraganaToEmojiVowelString = ""
    //Unicodeから絵文字に変換したものを保存
    vowelView.append(UnicodeScalar(i)!)
    //unicodeから絵文字にえ変換したものをアウトプットする
    hiraganaToEmojiVowelString = (String(vowelView))
    
    let inputDecryptKeyTextFieldStringCounter = hiraganaToEmojiVowelString.unicodeScalars.filter{$0.properties.isEmojiPresentation}
    print("$$$$$$$$$$$$$$$$$$$")
    print(inputDecryptKeyTextFieldStringCounter)
    if inputDecryptKeyTextFieldStringCounter.count != 1 {
    //暗号文のアラートを出す
    print(i)
    } else {
        print("ok")
    }
    print(n)
}
